## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place

Terraform will perform the following actions:

  # kubernetes_manifest.argocd-gateway will be updated in-place
!   resource "kubernetes_manifest" "argocd-gateway" {
!       manifest = {
!           spec       = {
!               servers  = [
+                   {
+                       hosts = [
+                           "argocd.wayofthesys.org",
                        ]
+                       port  = {
+                           name     = "http"
+                           number   = 80
+                           protocol = "HTTP"
                        }
                    },
                    {
                        hosts = [
                            "argocd.wayofthesys.org",
                        ]
                        port  = {
                            name     = "https"
                            number   = 443
                            protocol = "HTTPS"
                        }
                        tls   = {
                            credentialName = "argocd-secret"
                            httpsRedirect  = false
                            mode           = "SIMPLE"
                        }
                    },
                ]
                # (1 unchanged element hidden)
            }
            # (3 unchanged elements hidden)
        }
!       object   = {
!           spec       = {
!               servers  = [
!                   {
                        name            = null
!                       port            = {
!                           name       = "https" -> "http"
!                           number     = 443 -> 80
!                           protocol   = "HTTPS" -> "HTTP"
                            # (1 unchanged element hidden)
                        }
!                       tls             = {
!                           credentialName        = "argocd-secret" -> (known after apply)
!                           httpsRedirect         = false -> (known after apply)
!                           mode                  = "SIMPLE" -> (known after apply)
                            # (9 unchanged elements hidden)
                        }
                        # (3 unchanged elements hidden)
                    },
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "argocd.wayofthesys.org",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "https"
+                           number     = 443
+                           protocol   = "HTTPS"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = "argocd-secret"
+                           httpsRedirect         = false
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = "SIMPLE"
+                           privateKey            = (known after apply)
+                           serverCertificate     = (known after apply)
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
                ]
                # (1 unchanged element hidden)
            }
            # (3 unchanged elements hidden)
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
